//Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 (20 20,5 21 21,5….).

// let str = ''
// for(let i = 20; i <= 30; i = i + 0.5) {
//    str += i + ' '
// }
// console.log(str)



//Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів.
// const x = 27
// for(let i = 10; i <= 100; i = i + 10){
//     console.log(`${i} * ${x} = ${i * x}`)
// }




//Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N.

// const myFn = function(n) {
//     for(let i = 1; i <= 100; i++){
//         if(i*i < n) {
//             console.log(i)
//         } 
//     }
// }
// myFn(50)




//Дане ціле число. З'ясувати, чи є воно простим (простим називається число, більше 1, які не мають інших дільників крім 1 і себе).

// const myFn = function(x) {
//     if (x < 1) {
//         return console.log('Це не просте число');
//     }
//     if(x === 1) {
//         return console.log('Це просте число')
//     }
    
//     for(i = 2; i < x; i++) {
//         if(x % i === 0) {
//             return console.log('Це не просте число')
//         } 
//     }

//     return console.log('Це просте число')
// }

// myFn(17)



//Дане деяке число. Визначити, чи можна одержати це число шляхом зведення числа 3 у деякий ступінь. (Наприклад, числа 9, 81 можна отримати, а 13 - не можна).

// function myFn(num) {
//     let pow = 1 
//     for(i = 1; i <= num; i++) {
//         if(Math.pow(3, pow) > num){
//             return false
//         }
//         if(Math.pow(3, pow) === num) {
//             return true
//         }
//         pow++

//     }
// }

// console.log(myFn(81))
