//Вивести на сторінку в один рядок через кому числа від 10 до 20.
// for (let i = 10; i < 21; i++) { // выведет 0, затем 1, затем 2
//     console.log(i)
//   }
myAr = [10,11,12,13,14,15,16,17,18,19,20]
console.log(myAr)

//Вивести квадрати чисел від 10 до 20.
for (let i = 10; i <=20; i++) {
    console.log (`Квадрат числа ${i} = ${i * i}`);
}

//Вивести таблицю множення на 7
for (let i = 1; i <= 10; i++) {
    console.log(`7 * ${i} = ${7 * i}`)
}

//Знайти суму всіх цілих чисел від 1 до 15.
let sum = 0;
for(let i = 1; i <= 15; i++){
  sum += i;
}
console.log(sum)

//Знайти добуток усіх цілих чисел від 15 до 35.
let sum1 = 1;
for(let i = 1; i <= 15; i++){
  sum1 *= i;
}
console.log(sum1)

//Знайти середнє арифметичне всіх цілих чисел від 1 до 500.
let sum2 = 1;
for(let i = 1; i <= 500; i++){
  sum2 += i;
}
console.log(sum2 / 500)

//Вивести суму лише парних чисел в діапазоні від 30 до 80.
let sum3 = 0
for (let i = 30; i <= 80; i++) {
    if (i % 2 == 0) {
    sum3 += i
    }
  }
  console.log( sum3 );

  //Вивести всі числа в діапазоні від 100 до 200 кратні 3.
  for (let i = 100; i <= 200; i++) {
    if (i % 3 == 0) {
        console.log( i );
    }
  }

  //Дано натуральне число. Знайти та вивести на сторінку всі його дільники.




 //Надрукувати повну таблицю множення від 1 до 10.

//  for(let i = 1; i <=9; i++) {
//     for(let j = 1; j <= 9; j++) {
//         console.log(`${i} * ${j} = ${i * j}`)
//     }
// }


